Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/tax_credits_and_reliefs_for_people_with_disabilities/trust_funds_for_permanently_incapacitated_people.html.txt.tmx
Source language: en
Languages: ga

source: Trust funds for permanently incapacitated people
ga: Cistí Iontaobhais do dhaoine faoi mhíchumas buan

source: You can set up trust funds from the proceeds of public subscriptions to benefit those who are permanently and totally incapacitated
ga: Is féidir cistí iontaobhais a bhunú in Éirinn ón airgead a bhailítear ón bpobal ar mhaithe leo siúd atá faoi mhíchumas buan agus iomlán

source: ("Permanently incapacitated" means the beneficiary of the fund is totally and permanently unable to maintain themselves as a result of physical or mental infirmity
ga: (Ciallaíonn "míchumas buan" nach mbeidh dílseánach an chiste go buan in ann é/í féin a chothabháil de bharr éasláinte fisiciúil nó intinne

source: Their incapacity may have occurred as the result of an accident, illness, progressive disorder or similar disability.)
ga: D'fhéadfadh sé seo a bheith amhlaidh de bharr timpiste, galair, éasláinte a fhaigheann níos measa de réir a chéile, & rl)

source: The money that is then raised from these events, may be held in trust for the permanently incapacitated individual and used for their benefit throughout their life. For example, funds may be used to pay for health treatment, a holiday, specialised equipment or a carer for the beneficiary
ga: Faoi Mhír 12 den Acht Airgeadais 1999, tá soláthar déanta le cinntiú go bhféadfadh cistí iontaobhais faoi leith a bhunaítear ar mhaithe leis an duine seo a bheith saor ó cháin

source: Under Section 12 of the Finance Act 1999, certain trust funds established for the benefit of this person may be exempt from income tax
ga: Mar shampla, d'fhéadfaí an t-airgead a úsáid le n-íoc as cóir leighis, saoire, trealamh cúnta speisialta, cúramaí don duine, & rl

source: A trust is a legally enforceable (agreement) that is established between the trustees of the fund and the beneficiary or beneficiaries
ga: Is féidir iontaobhas a chur i bhfeidhm faoin dlí (comhaontú) agus bunaítear é idir iontaobhais an chiste agus an dílseánach nó dílseánaigh

source: The trustees are the administrators (or custodians) of the fund and their role is to maintain and operate the assets of the trust for the benefit of the beneficieries
ga: Is iad na hiontaobhaithe riarthóirí (nó caomhnóirí) an chiste agus tá sé mar dhualgas orthu sócmhainní an iontaobhais a choinneáil agus a oibriú ar mhaithe leis an dílseánaigh

source: The beneficiary (or beneficiaries), is the permanently incapacitated person who benefits from the funds raised on their behalf
ga: Is é/í an dílseánach (nó dílseánaigh) an duine atá faoi mhíchumas buan a bhaineann leas as an airgead a bailíodh ar a s(h)on

source: Trustees cannot have any connection with the beneficiary
ga: Ní féidir le hiontaobhaithe aon cheangal a bheith acu leis an dílseánach

source: (In other words, they cannot be family members or spouses of the beneficiary
ga: (I bhfocail eile ní féidir le baill teaghlaigh agus céilí an dílseánaigh a bheith ina n-iontaobhaithe

source: They must remain independent and objective in decisions arising from the operation of the trust to ensure they act in the best interest of the beneficiary)
ga: Ní mór dóibh a bheith neamhspléach agus oibiachtúil maidir le haon chinneadh atá le tógáil faoi oibriú an iontaobhais le cinntiú go bhfuil gach gníomh a dhéantar chun sochair an dílseánaigh)

source: Funds raised from public subscriptions generally mean monies raised from a public appeal or a charitable event
ga: Go ginearálta is ionann airgead a bhailítear ón bpobal agus airgead a bhailítear ó achainí phoiblí, imeacht carthanach, & rl

source: To avail of the tax exemptions, the trust must be set up under specific conditions as follows:
ga: Ar mhaithe le díolúintí cánacha a fháil, ní mór an t-iontaobhas a bhunú faoi choinníollacha faoi leith mar seo a leanas:

source: • The trust must only be for the benefit of the named individual(s) for the person's lifetime
ga: • Ní mór don iontaobhas a bheith rite ar mhaithe leis an duine/daoine ainmnithe ar feadh a s(h)aoil

source: The individual(s) must be permanently and totally incapacitated
ga: Ní mór do na daoine a bheith go hiomlán agus go buan faoi mhíchumas

source: In other words, the person must suffer from a physical or mental infirmity which results in them being unable to maintain themselves
ga: I bhfocail eile, ní mór go mbeadh éasláinte fhisiciúil nó intinne ar an duine a fhágann nach féidir leis/léi é/í féin a chothú

source: • Trustees must have no connection with the permanently incapacitated individual
ga: • Ní féidir le hiontaobhaithe aon cheangal a bheith acu leis an duine atá faoi mhíchumas buan

source: • The funds of the trust must be created by public subscriptions
ga: • Ní mór airgead an iontaobhais a bhailiú ó íocaíochtaí poiblí

source: This means that a public appeal must be made inviting subscriptions
ga: Mar sin ní mór achainí phoiblí a dhéanamh ag tabhairt cuireadh do dhaoine airgead a thabhairt

source: If the total subscriptons exceed €381,000, no single individual can contribute more than 30% of the total
ga: Má thagann níos mó ná €381,000 isteach, ní féidir le duine amháin aonair níos mó ná 30% den iomlán a thabhairt

source: • The trustees hold in trust for the individual, funds that are to be applied for the benefit of the named individuals
ga: • Coinníonn na hiontaobhaithe in iontaobhas don duine atá i gceist airgead a bhainfear úsáid as ar mhaithe leis na daoine ainmnithe

source: • If the individual is to be exempt from tax the money from the trust fund must be their sole or main source of income
ga: • Má tá díolúine ó cháin le bheith ag an duine ní mór gurb é airgead an iontaobhais an t-aon nó an phríomhfhoinse ioncaim atá aige/aici

source: Income from social welfare payments is not counted when deciding if the trust fund is the main source of income
ga: Ní chuirtear ioncam ó íocaíochtaí leasa shóisialaigh san áireamh nuair atá cinneadh dhá dhéanamh an é an t-iontaobhas an phríomhfhoinse ioncaim

source: • Section 10 of Finance Act 2014 amended the Taxes Consolidation Act 1997 to allow the undistributed part of the trust funds on the death of an incapacitated person (or of the last surviving incapacitated person) to be part of the person’s estate if they have a surviving spouse, civil partner or child
ga: • Déanann Alt 10 den Acht Airgeadais 2014 leasú ar an Acht Comhdhlúite Cánacha 1997 chun ceadú an chuid neamhdháilte de na cistí iontaobhais ar bhás duine éagumasaithe (nó ar bhás duine marthanach deiridh faoi éagumas ) a bheith mar chuid den eastát an duine má tá céile marthanach , páirtnéir sibhialta nó leanbh acu

source: Previously, the undistributed trust funds at the date of death had to be used for charitable purposes or appointed in favour of the trustees of charitable bodies
ga: Roimhe sin, caithfidh na cistí iontaobhais neamhdháilte bheith úsáidte ar mhaithe carthanacha nó ceaptha i bhfabhair d'iontaobhaithe cumann carthanachta

source: This still applies if there is no surviving spouse, civil partner or child
ga: Baineann sé seo go fóill mura bhfuil aon chéile marthanach, páirtnéir sibhialta nó leanbh

source: Trust funds set up for the benefit of a permanently incapacitated person(s) allow both the trustees and the incapacitated individual(s) to avail of certain tax exemptions
ga: Tugann cistí iontaobhais a bhunaítear ar mhaithe le duine/daoine faoi mhíchumas buan deis do na hiontaobhaithe agus don duine/daoine faoi mhíchumas leas a bhaint as díolúintí faoi leith cánacha

source: The following is a summary of the tax exemptions:
ga: Is é seo a leanas achoimre ar na díolúintí cánacha sin:

source: • The trustees of a qualifying trust are exempt from income tax in respect of income they receive from the investment of the trust funds
ga: • Bíonn díolúine ó cháin ag iontaobhaithe iontaobhais cháilithe maidir le haon ioncam a fhaigheann siad ó infheistíocht chistí an iontaobhais

source: • The trustees are entitled to reclaim any Deposit Interest Retention Tax (DIRT) paid by them on or after 6 April 1997
ga: • Is féidir leis na hiontaobhaithe aon Cháin Choinneála ar Ús Cuntas Taisce (CCÚCT) a d'íoc siad ar nó i ndiaidh an 6 Aibreán 1997 a aiséileamh

source: • The incapacitated individual is exempt from tax in respect of payments made by the trustees to or for his/her benefit
ga: • Ní íocann an té atá faoi mhíchumas aon cháin ar íocaíochtaí a dhéanann na hiontaobhaithe leis/léi nó ar a s(h)on

source: They are also exempt from tax on income from the investment of payments
ga: Tá an duine féin saor ó cháin a íoc ar aon ioncam a éiríonn as infheistíocht íocaíochtaí

source: Applying for tax exemption
ga: Iarratas a dhéanamh ar díolúine chánach

source: The incapacitated person or persons receiving income and the trustees must declare this income to the Revenue Commissioners when making their annual tax returns
ga: Ní mór don duine nó daoine faoi mhíchumas agus na hiontaobhaithe a chur in iúl do na Coimisinéirí Ioncaim go bhfuil ioncam dhá fháil acu ón iontaobhas ar a dtuairisceán bliantúil cánach

source: When a claim is first made for a tax exemption, the following documention is required:
ga: Nuair a dhéantar éileamh don chéad uair ar díolúine chánach teastaíonn na cáipéisí seo a leanas:

source: • A medical certificate detailing the person's incapacity
ga: • Teastas leighis a dhéanann cur síos ar mhíchumas an duine,

source: • A copy of the trust deed
ga: • Cóip den ghníomhas iontaobhais,

source: • A declaration from the trustees declaring that the conditions regarding public subscriptions are met
ga: • Dearbhú ó na hiontaobhaithe a dheimhníonn go bhfuil na coinníollacha maidir le híocaíochtaí poiblí dhá shásamh

source: Setting up a trust fund has complex legal implications
ga: Baineann impleachtaí casta dlíthiúla le ciste iontaobhais a bhunú

source: It is important therefore to seek the advice of a qualified legal professional (for example, a solicitor)
ga: Tá sé tábhachtach mar sin comhairle a fháil ó dhuine proifisiúnta cáilithe dlí (mar shampla, aturnae)

source: In addition, it is very important to discuss the tax implications with an accountant and the Revenue Commissioners
ga: Chomh maith leis sin, tá sé an-tábhachtach na himpleachtaí cánacha a phlé le cuntasóir agus leis na Coimisinéirí Ioncaim

source: It is also possible to obtain tax relief for payments made to incapacited individuals, through a deeds of covenant
ga: Is féidir faoiseamh cánach a fháil freisin ar íocaíochtaí a dhéantar le daoine atá faoi mhíchumas, tríd gníomhas cúnaint

source: Tax relief for payments made to incapacitated individuals can also be obtained through the investment income from personal injuries awards
ga: Is féidir tuilleadh a léamh anseo maidir le gníomhais chúnaint

source: More information is available about Personal Injury Compensation Payments and tax relief (pdf)
ga: Is féidir faoiseamh cánach ar íocaíochtaí a dhéantar le daoine faoi mhíchumas a fháil freisin tríd ioncam infheistíochta ó chúiteamh ar ghortú pearsanta.Léigh tuilleadh anseo maidir le hÍocaíochtaí Cúitimh ar Ghortú Pearsanta agus faoiseamh cánach (pdf)
